{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"txt","type":"string"},{"name":"label","type":"integer"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":0,"txt":"Bromwell High is a cartoon comedy. It ran at the same time as some other programs about school life, such as Teachers. My 35 years in the teaching profession lead me to believe that Bromwell Highs satire is much closer to reality than is Teachers. The scramble to survive financially, the insightful students who can see right through their pathetic teachers pomp, the pettiness of the whole situation, all remind me of the schools I knew and their students. When I saw the episode in which a student repeatedly tried to burn down the school, I immediately recalled ......... at .......... High. A classic line INSPECTOR I am here to sack one of your teachers. STUDENT Welcome to Bromwell High. I expect that many adults of my age think that Bromwell High is far fetched. What a pity that it is not!","label":1},{"index":1,"txt":"Homelessness or Houselessness as George Carlin stated has been an issue for years but never a plan to help those on the street that were once considered human who did everything from going to school, work, or vote for the matter. Most people think of the homeless as just a lost cause while worrying about things such as racism, the war on Iraq, pressuring kids to succeed, technology, the elections, inflation, or worrying if they will be next to end up on the streets. But what if you were given a bet to live on the streets for a month without the luxuries you once had from a home, the entertainment sets, a bathroom, pictures on the wall, a computer, and everything you once treasure to see what it is like to be homeless? That is Goddard Bolts lesson.Mel Brooks who directs who stars as Bolt plays a rich man who has everything in the world until deciding to make a bet with a sissy rival Jeffery Tambor to see if he can live in the streets for thirty days without the luxuries; if Bolt succeeds, he can do what he wants with a future project of making more buildings. The bets on where Bolt is thrown on the street with a bracelet on his leg to monitor his every move where he cannot step off the sidewalk. He is given the nickname Pepto by a vagrant after it is written on his forehead where Bolt meets other characters including a woman by the name of Molly Lesley Ann Warren an exdancer who got divorce before losing her home, and her pals Sailor Howard Morris and Fumes Teddy Wilson who are already used to the streets. They are survivors. Bolt is not. He is not used to reaching mutual agreements like he once did when being rich where it is fight or flight, kill or be killed.While the love connection between Molly and Bolt was not necessary to plot, I found Life Stinks to be one of Mel Brooks observant films where prior to being a comedy, it shows a tender side compared to his slapstick work such as Blazing Saddles, Young Frankenstein, or Spaceballs for the matter, to show what it is like having something valuable before losing it the next day or on the other hand making a stupid bet like all rich people do when they do not know what to do with their money. Maybe they should give it to the homeless instead of using it like Monopoly money.Or maybe this film will inspire you to help others.","label":1},{"index":2,"txt":"Brilliant overacting by Lesley Ann Warren. Best dramatic hobo lady I have ever seen, and love scenes in clothes warehouse are second to none. The corn on face is a classic, as good as anything in Blazing Saddles. The take on lawyers is also superb. After being accused of being a turncoat, selling out his boss, and being dishonest the lawyer of Pepto Bolt shrugs indifferently I am a lawyer he says. Three funny words. Jeffrey Tambor, a favorite from the later Larry Sanders show, is fantastic here too as a mad millionaire who wants to crush the ghetto. His character is more malevolent than usual. The hospital scene, and the scene where the homeless invade a demolition site, are alltime classics. Look for the legs scene and the two big diggers fighting one bleeds. This movie gets better each time I see it which is quite often.","label":1}]}